export default [
    {
      id: 1,
      question: "ما هي عاصمة فرنسا؟",
      options: ["باريس", "لندن", "برلين", "مدريد"],
      correctAnswer: "باريس",
    },
    {
      id: 2,
      question: "ما هي أكبر قارة في العالم؟",
      options: ["آسيا", "أفريقيا", "أوروبا", "أمريكا الجنوبية"],
      correctAnswer: "آسيا",
    },
    {
      id: 3,
      question: "من هو مؤسس شركة مايكروسوفت؟",
      options: ["ستيف جوبز", "بيل غيتس", "مارك زوكربيرغ", "إيلون ماسك"],
      correctAnswer: "بيل غيتس",
    },
  ];