export default[
        {
            icon: '📝',
            title: 'مقالات',
            description: 'شروحات مبسطة لفهم مفاهيم البرمجة المختلفة.',
            href: '/articles',
        },
        {
            icon: '❓',
            title: 'كويزات',
            description: 'اختبر معلوماتك بطريقة ممتعة وتفاعلية.',
            href: '/quizzes',
        },
        {
            icon: '💬',
            title: 'سؤال وجواب',
            description: 'اسأل وجاوب، شارك المعرفة مع الجميع.',
            href: '/questions',
        },
        {
            icon: '🏆',
            title: 'المتصدرين',
            description: 'تعرف على أفضل المبرمجين الذين يتصدرون التحديات والاختبارات.',
            href: '/top-performers',
        },
    ];